Repository: common-repository/seo-file-names
Catalog: languages/seo-file-names-*.po
Languages: fr_fr

source: Please upgrade PHP to version 7.2.0 or higher to use SEO File Names.
fr_fr: Veuillez mettre à niveau PHP vers la version 7.2.0 ou supérieure pour utiliser SEO File Names.

source: Please upgrade WordPress to version 4.9.18 or higher to use SEO File Names.
fr_fr: Veuillez mettre à niveau WordPress vers la version 4.9.18 ou supérieure pour utiliser SEO File Names.

source: %1$sSettings%2$s
fr_fr: %1$sRéglages%2$s

source: %1$sSaved time? Buy me a coffee.%2$s
fr_fr: %1$sGain de temps ? Payez votre café.%2$s

source: SEO File Names
fr_fr: Noms de fichiers SEO

source: Pause the plugin?
fr_fr: Plugin en pause ?

source: Do you want to pause the plugin?
fr_fr: Voulez-vous mettre le plugin en pause ?

source: Choose users
fr_fr: Choisir des utilisateurs

source: File names settings
fr_fr: Paramètres des noms de fichiers

source: Plugin translated title
fr_fr: Titre traduit du plugin

source: Do you want to pause the plugin ?
fr_fr: Voulez-vous mettre le plugin en pause ?

source: If the plugin is active (not paused) and no file names schema is set, the following scheme will apply:
fr_fr: Si le plug-in est actif (non mis en pause) et qu’aucun schéma de noms de fichiers n’est défini, le schéma suivant s’applique :

source: Choose the user who will use SEO File Names:
fr_fr: Choisissez l’utilisateur qui utilisera SEO File Names :

source: Administrator
fr_fr: Administrateur

source: Editor
fr_fr: Éditeur

source: Author
fr_fr: Auteur

source: Only selected user will run SEO File Names.
fr_fr: Seul l’utilisateur sélectionné exécutera SEO File Names.

source: Title
fr_fr: Titre

source: Current post, page or term title
fr_fr: Titre de l’article, de la page ou du terme en cours d’édition

source: Current post, page or term slug
fr_fr: Slug de l’article, de la page ou du terme en cours d’édition

source: Current post or page type. On terms, the type of post to which the term is linked
fr_fr: Type de l’article ou de la page en cours d’édition. Sur les termes, type du post auquel celui-ci est lié

source: Tag
fr_fr: Étiquette

source: Current post or page tag, empty on terms
fr_fr: Étiquettes de l’article ou de la page en cours d’édition, vide sur les termes

source: Category
fr_fr: Catégorie

source: Current post or page category, empty on terms
fr_fr: Catégorie de l’article ou de la page en cours d’édition, vide sur les termes

source: Current post or page author, empty on terms
fr_fr: Auteur de l’article ou de la page en cours, vide sur les termes

source: Taxonomy
fr_fr: Taxonomie

source: Current term taxonomy name, empty on posts and pages
fr_fr: Taxonomie du terme en cours d’édition, vide sur les articles et les pages

source: Date published
fr_fr: Date de publication

source: Current post or page first published date, empty on terms
fr_fr: Date de publication de l’article ou de la page en cours d’édition, vide sur les termes

source: Date modified
fr_fr: Date de modification

source: Last date, current post or page as been modified, empty on terms
fr_fr: Date de modification de l’article ou de la page en cours d’édition, vide sur les termes

source: Site name
fr_fr: Nom du site

source: The site name
fr_fr: Le nom du site

source: Site description
fr_fr: Description du site

source: The site description
fr_fr: La description du site

source: Original filename
fr_fr: Nom du fichier d’origine

source: The sanitized orginal filename, usefull to keep track of your local files
fr_fr: Le nom de fichier original nettoyé, utile pour garder la trace de vos fichiers locaux

source: No
fr_fr: Non

source: Yes
fr_fr: Oui

source: Click on a tag to start building the file name schema.
fr_fr: Cliquez sur un bouton pour commencer à créer le schéma de nom de fichier.

source: You can insert arbitrary text between each tag.
fr_fr: Vous pouvez insérer du texte arbitraire entre chaque balise.

source: Clear
fr_fr: Effacer

source: This filename scheme will apply to all files you upload to your website from now on.
fr_fr: Ce schéma de nom de fichier s’appliquera à tous les fichiers que vous mettrez dans la bibliothèque de média à partir de maintenant.

source: Goal of SEO File Names
fr_fr: Objectif de SEO File Names

source: SEO File Names aims to save you time and boost your SEO by automatically renaming the files you upload to the media library with SEO friendly names.
fr_fr: SEO File Names vous fait gagner du temps et booste votre référencement en renommant automatiquement les fichiers que vous chargez dans la médiathèque avec des noms adaptés au référencement.

source: This is often overlooked by website authors whereas search engines also rely on file names to understand and index them.
fr_fr: Ceci est souvent négligé par les auteurs de sites Web, alors que les moteurs de recherche s’appuient aussi sur les noms de fichiers pour les comprendre et les indexer.

source: It also happens to me very often that clients ask me to upload many images and documents to their website. This plugin has saved me a lot of time by removing the automatic renaming software step (and license fees) before importing the files.
fr_fr: Il m’arrive aussi très souvent que des clients me demandent de mettre en ligne de nombreuses images et documents sur leur site Web. Ce plugin m’a fait gagner beaucoup de temps en supprimant l’étape de renommage automatique du logiciel (et les frais de licence) avant d’importer les fichiers.

source: How does SEO File Names works?
fr_fr: Comment fonctionne SEO File Names?

source: When you upload a file to the media library, SEO File Names gathers datas from the post, page or term you are currently editing: %stitle, slug, category, tag or taxonomy, type, dates, author...%s
fr_fr: Lorsque vous mettez un fichier dans la bibliothèque de média, le plugin rassemble des données à partir de l’article, de la page ou du terme que vous êtes en train d’éditer : %stitre, slug, catégorie, étiquette ou taxonomie, type, dates, auteur…%s

source: ...plus the global site datas: %ssite name and site description%s, useful to reinforce your brand.
fr_fr: ...plus les données globales du site : %snom du site et description du site%s, utiles pour renforcer votre marque.

source: With this datas, you build the file names using the predefined tags.
fr_fr: Avec ces données, vous <b>construisez les noms des fichiers</b> à l’aide des balises prédéfinies.

source: The arbitrary text can only contain the characters [a-z], [0-9], space and '-'.
fr_fr: Le texte arbitraire ne peut contenir que les caractères [a-z], [0-9], espace et '-'.

source: Special characters, accented characters and capital letters will be filtered out.
fr_fr: Les caractères spéciaux, les caractères accentués et les lettres majuscules seront filtrés.

source: Each part of the file name will be separated from the others by dashes if they are not.
fr_fr: Chaque partie du nom de fichier sera séparée des autres par des tirets.

source: SEO File Names works best when adding files to the media library while editing articles, pages or terms, as it uses the datas being edited.
fr_fr: SEO File Names fonctionne mieux en ajoutant des fichiers à la médiathèque pendant l’édition d’articles, de pages ou de termes car il utilise les données en cours de modification.

source: Does this plugin save you time?
fr_fr: Ce plugin vous fait-il gagner du temps ?

source: Buy me a coffee so I can continue to improve SEO File Names.
fr_fr: Payez votre café pour que je puisse continuer à améliorer SEO File Names.

source: Donate with PayPal button
fr_fr: Faire un don avec PayPal bouton

source: Donate
fr_fr: Donner

source: Donate through PayPal
fr_fr: Faites un don par PayPal

source: Cool features coming soon:
fr_fr: Fonctionnalités à venir bientôt :

source: On-the-fly renaming of tag values, useful for types and taxonomies particularly.
fr_fr: Renommage à la volée des valeurs des balises, utile pour les types et les taxonomies en particulier.

source: Dates and hours schemes options
fr_fr: Options de schémas de dates et d’heures

source: Custom taxonomies
fr_fr: Taxonomies personnalisées

source: Suggest a new feature
fr_fr: Suggérer une nouvelle fonctionnalité

source: https://afterglow-web.agency/en/seo-file-names/
fr_fr: https://afterglow-web.agency/noms-fichiers-seo/
